Bocha91/SK6805_EFM32GG/Drivers/segmentlcd.c
  /* Parameter consistancy check */
  if (value >= NUM_VAL_MAX_HEX) {
    value = NUM_VAL_MAX_HEX;
  }

  /* If an update is in progress we must block, or there might be tearing */
  LCD_SyncBusyDelay(0xFFFFFFFF);

  /* Freeze updates to avoid partial refresh of display */
  LCD_FreezeEnable(true);

  /* Turn off all number LCD segments */
  SegmentLCD_NumberOff();

  for (digit = 0; digit < NUM_DIGITS; digit++) {
    num        = (value >> (4 * digit)) & 0x0f;
    bitpattern = EFM_Numbers[num];
    for (i = 0; i < 7; i++) {
      bit = EFM_Display.Number[digit].bit[i];
      com = EFM_Display.Number[digit].com[i];
      if (bitpattern & (1 << i)) {
        LCD_SegmentSet(com, bit, true);
      }
    }
  }

  /* Sync LCD registers to LE domain */
  LCD_FreezeEnable(false);
}

/**************************************************************************//**
 * @brief Write text on LCD display
 * @param string Text string to show on display
 *****************************************************************************/
void SegmentLCD_Write(const char *string)
{
  int      data, length, index;
  uint16_t bitfield;
  uint32_t com, bit;
  int      i;

  length = strlen(string);
  index  = 0;

  /* If an update is in progress we must block, or there might be tearing */
  LCD_SyncBusyDelay(0xFFFFFFFF);

  /* Freeze LCD to avoid partial updates */
  LCD_FreezeEnable(true);

  /* Turn all segments off */
  SegmentLCD_AlphaNumberOff();

  /* Fill out all characters on display */
  for (index = 0; index < ALPHA_DIGITS; index++) {
    if (index < length) {
      data = (int) *string;
    } else {       /* Padding with space */
      data = 0x20; /* SPACE */
    }
    /* Defined letters currently starts at "SPACE" - ASCII 0x20; */
    data = data - 0x20;
    /* Get font for this letter */
    bitfield = EFM_Alphabet[data];

    for (i = 0; i < 14; i++) {
      bit = EFM_Display.Text[index].bit[i];
      com = EFM_Display.Text[index].com[i];

      if (bitfield & (1 << i)) {
        /* Turn on segment */
        LCD_SegmentSet(com, bit, true);
      }
    }
    string++;
  }
  /* Enable update */
  LCD_FreezeEnable(false);
}

/******************************************************************************
* @brief Display blocks on LCD display: blank, fill, outline, outline & fill
* @param topMode array of block modes for the top row with element zero
* representing the left-most column and element six representing the
* right-most column
* @param botMode array of block modes for the bottom row with element zero
* representing the left-most column and element six representing the
* right-most column
******************************************************************************/
static void displayBlock(
  SegmentLCD_BlockMode_TypeDef topMode[SEGMENT_LCD_NUM_BLOCK_COLUMNS],
  SegmentLCD_BlockMode_TypeDef botMode[SEGMENT_LCD_NUM_BLOCK_COLUMNS])
{
  int index;
  int mode;
  uint16_t bitfield;
  uint32_t com, bit;
  int      i;

  /* Fill out all blocks in the top row of the display */
  for (index = 0; index < SEGMENT_LCD_NUM_BLOCK_COLUMNS; index++) {
    mode = topMode[index];

    /* Get segment bitmap for this block position */
    bitfield = Blocks[mode];

    for (i = 0; i < 8; i++) {
      if (bitfield & (1 << i)) {
        bit = EFM_Display.TopBlocks[index].bit[i];
        com = EFM_Display.TopBlocks[index].com[i];

        // Turn on segment
        LCD_SegmentSet(com, bit, true);
      }
    }
  }
  /* Fill out all blocks in the bottom row of the display */
  for (index = 0; index < SEGMENT_LCD_NUM_BLOCK_COLUMNS; index++) {
    mode = botMode[index];

    /* Get segment bitmap for this block position */
    bitfield = Blocks[mode];

    for (i = 0; i < 8; i++) {
      if (bitfield & (1 << i)) {
        bit = EFM_Display.BotBlocks[index].bit[i];
        com = EFM_Display.BotBlocks[index].com[i];

        // Turn on segment
        LCD_SegmentSet(com, bit, true);
      }
    }
  }
}

#if defined(LCD_MODULE_CE322_1001)
/**************************************************************************//**
 * @brief Turn on or off individual pixels in the array
 * @param element "pixel number", range 0 - 34
 * @param on false is off, true is on
 *****************************************************************************/
void SegmentLCD_Array(int element, bool on)
{
  uint32_t com, bit;

  com = EFM_Display.Array.com[element];
  bit = EFM_Display.Array.bit[element];
  LCD_SegmentSet(com, bit, on);
}

#else

/**************************************************************************//**
 * @brief Light up or shut off Ring of Indicators
 * @param anum "Segment number" on "Ring", range 0 - 7
 * @param on Zero is off, non-zero is on
 *****************************************************************************/
void SegmentLCD_ARing(int anum, int on)
{
  uint32_t com, bit;

  com = EFM_Display.ARing.com[anum];
  bit = EFM_Display.ARing.bit[anum];

  if (on) {
    LCD_SegmentSet(com, bit, true);
  } else {
    LCD_SegmentSet(com, bit, false);
  }
}

/**************************************************************************//**
 * @brief Light up or shut off Battery Indicator
 * @param batteryLevel Battery Level, 0 to 4 (0 turns all off)
 *****************************************************************************/
void SegmentLCD_Battery(int batteryLevel)
{
  uint32_t com, bit;
  int      i, on;

  for (i = 0; i < 4; i++) {
    if (i < batteryLevel) {
      on = 1;
    } else {
      on = 0;
    }
    com = EFM_Display.Battery.com[i];
    bit = EFM_Display.Battery.bit[i];

    if (on) {
      LCD_SegmentSet(com, bit, true);
    } else {
      LCD_SegmentSet(com, bit, false);
    }
  }
}

/**************************************************************************//**
 * @brief Light up or shut off Energy Mode indicator
 * @param em Energy Mode numer 0 to 4
 * @param on Zero is off, non-zero is on
 *****************************************************************************/
void SegmentLCD_EnergyMode(int em, int on)
{
  uint32_t com, bit;

  com = EFM_Display.EMode.com[em];
  bit = EFM_Display.EMode.bit[em];

  if (on) {
    LCD_SegmentSet(com, bit, true);
  } else {
    LCD_SegmentSet(com, bit, false);
  }
}
#endif
